export default {
  hash: {
    result: {
      cn: '3c00bc3f803003c00dc73fb18331870187f70bf20f160f540bd121b92010'
    },
    stage: {
      A: '3c007e007e007e00ff00ff01ff81e781e783c3c3ffc7ffe7ffe781ef81ff00f',
      B: '3fe03ff83ff83cf83c3c3c783ff83ff03ff83ffc3c3c3c3c3c7c3ffc3ff83ff0',
      C: '7f00ff83ffc3ffe7c3c7800f800f000f000f80078107c3f3ffe3ffc0ff807e0',
      D: 'ffe0fff8fffcfffcf03ef01ef01ff01ff01ff01ff01ef03efffefffcfff8ffe0',
      E: '3ffc3ffc3ffc3ffc3c003c003ff03ff03ff03ff03c003c003ffc3ffc3ffc3ffc',
      F: '3ffc3ffc3ffc3ffc3c003c003c003ff03ff03ff03c003c003c003c003c003c00',
      G: '7e00ff83ffc3ffe7c1c7800f800f8fff8fff8ff780f7e1f3fff3fff0fff07ef',
      H: '781e781e781e781e781e781e7ffe7ffe7ffe7ffe781e781e781e781e781e781e',
      I: '3c003c003c003c003c003c003c003c003c003c003c003c003c003c003c003c0',
      J: '1e001e001e001e001e001e001e001e001e001e003e383c7ffc3ff81ff80fe0',
      K: 'f83ef87cf8f8f9f0fbe0ffc0ff80ff80ffc0ffc0fbe0f9f0f8f8f87cf87cf83e',
      L: '3c003c003c003c003c003c003c003c003c003c003c003c003ffc3ffc3ffc3ffc',
      M: 'f00ff81ff83ffc3ffe7ffe7ffffffffff7eff7eff3cff3cff00ff00ff00ff00f',
      N: '781e7c1e7c1e7e1e7f1e7f9e7fde7fde7bfe7bfe79fe78fe787e787e783e781e',
      O: '7e01ff83ffc7ffe7c3ef81ff00ff00ff00ff00ff81f7c3f7ffe3ffc1ff807f0',
      P: '3ff03ff83ffc3ffc3c3c3c3c3c3c3ffc3ffc3ff83ff03c003c003c003c003c00',
      Q: '7e01ff83ffc3e7c781e781e781e781e781e7c3e3ffc3ff80ff007e003c003c0',
      R: '7fe07ff87ff87ffc7c3c7c3c7c7c7ffc7ff87ff07ff07df07cf87c787c7c7c3e',
      S: '7e00ff81ffc3ffc3c3c3f001fc01ff007fc01fc0c3c3c3c3ffc1ffc0ff807f0',
      T: '7ffe7ffe7ffe7ffe03c003c003c003c003c003c003c003c003c003c003c003c0',
      U: '781e781e781e781e781e781e781e781e781e781e781e7c3e3ffc3ffc1ff80fe0',
      V: 'f80ff81f781e7c1e3c3e3c3c3e7c1e781e780f780ff00ff007e007e007e003c0',
      W: 'e007e18773ce73ce73ce77ee3fec3e7c3e7c1e781c381c3800000000',
      X: '7c3e7c3e3e7c3ff81ff80ff00fe007e007e00ff00ff01ff83efc3e7c7c3ef83f',
      Y: 'f81f7c3e7c3c3e7c1ff81ff00ff007e003c003c003c003c003c003c003c003c0',
      Z: '7ffe7ffe7ffe7ffe00fc01f803f003e007c00fc01f803f007ffe7ffe7ffe7ffe',
      1: 'f001f003f007f00ff00ff006f002f000f000f000f000f000f000f000f000f0',
      2: '7e00ff01ff83ffc3e7c043c007c00f801f803f007e00f803ffc3ffc3ffc3ffc',
      3: '7e00ff81ff83e7c3c7c007c03f803f003f8007c003c3c3c3ffc3ffc1ff807e0',
      4: '7800f801f801f803f807f80f781f783e783c787ffe7ffe7ffe007800780078',
      5: 'ff80ff81ff81ff81e001fc01ff01ff81efc043c003c1c3c3efc1ff81ff007e0',
      6: '1f003e003c007800f801fe01ff83ffc3e7c3c3c3c3c3c3c3ffc1ffc0ff807e0',
      7: '3ffc3ffc3ffc3ffc007800f801f001e003e003c007c007800f801f001e003e00',
      8: '7e00ff01ff81c781c381e781ff00fe01ff83ffc3c3c3c3c3e7c3ffc1ff807e0',
      9: '7e01ff83ff83ffc3c3c383c3c3c3e7c3ffc1ff80ff801f003e007c007800f00',
      0: '7e01ff03ff83ffc7c3e783e781e781e781e781e783e7c3e3ffc3ffc1ff007e0',
      '-': 'ffffffffffffffffffffffff00000000000000000000'
    },
    droptype: {
      cn: {
        NORMAL_DROP: '564e564ffeeffee3fee7fe47fe477cf77cf71067fe6ffe6dd2fdd6ddde97d697',
        SPECIAL_DROP: '4404c4fcdefcfe4fe47fff74df74c2ff7fffffeeffaeda2e4a5f4a5f46d546c4',
        EXTRA_DROP: '40646f64ff74f474fe74fed6fed6eef76ef7fe35be35fe24be64bee4fbc4fbc4',
        FURNITURE: '100010de7ede7e401000ffffffff24cc6e5efe5a7e56fe7ffe51fee010ff10bf'
      }
    },
    dropimg: {
      cn: {
        1: '3800f800f80018001800180018001800180018001800180018001801ff01ff0',
        2: '7c00fe0187000300030003000300070006000e001c0038007000e001ff81ff8',
        3: '7c00ff00c3000300030003000f003c003f0003000180018001818381ff007e0',
        4: '6000e001e001e00360076006600c600c6018603ffc3ffc0060006000600060',
        5: '7f00ff00c000c000c000c000fe00c700038001800180018003818381ff007c0',
        6: '1e007f80e100c000c00180019e01ff01c301818181818180c180e3007f003e0',
        7: '1ff81ff800300070006000c000c001c001800180018003800380038003000300',
        8: '3c007f00c300c300c100c30073003e007e00c701838181818181c380ff007e0',
        9: '3c00fe00c3018301818181818180c380ff807d800180030003008701fe007c0',
        0: '3c007e00c300c301c3818181818181818181818181818380c300c3007e003c0',
        万: 'ffffffff06000600060007fc07fc04040c040c04080c180c300c700ce0f80000'
      }
    }
  },
  item: {
    2001: {
      name_i18n: {
        ko: '기초작전기록',
        ja: '入門作戦記録',
        en: 'Drill Battle Record',
        cn: '基础作战记录'
      }
    },
    2002: {
      name_i18n: {
        ko: '초급작전기록',
        ja: '初級作戦記録',
        en: 'Frontline Battle Record',
        cn: '初级作战记录'
      }
    },
    2003: {
      name_i18n: {
        ko: '중급작전기록',
        ja: '中級作戦記録',
        en: 'Tactical Battle Record',
        cn: '中级作战记录'
      }
    },
    2004: {
      name_i18n: {
        ko: '고급작전기록',
        ja: '上級作戦記録',
        en: 'Strategic Battle Record',
        cn: '高级作战记录'
      }
    },
    3003: {
      name_i18n: {
        ko: '순금',
        ja: '純金',
        en: 'Pure Gold',
        cn: '赤金'
      }
    },
    30011: {
      name_i18n: {
        ko: '원암',
        ja: '源岩鉱',
        en: 'Orirock',
        cn: '源岩'
      }
    },
    30012: {
      name_i18n: {
        ko: '원암 큐브',
        ja: '初級源岩',
        en: 'Orirock Cube',
        cn: '固源岩'
      }
    },
    30013: {
      name_i18n: {
        ko: '원암 큐브 번들',
        ja: '中級源岩',
        en: 'Orirock Cluster',
        cn: '固源岩组'
      }
    },
    30014: {
      name_i18n: {
        ko: '정제 원암',
        ja: '上級源岩',
        en: 'Orriock Concentration',
        cn: '提纯源岩'
      }
    },
    30061: {
      name_i18n: {
        ko: '파손된 장치',
        ja: '破損装置',
        en: 'Damaged Device',
        cn: '破损装置'
      }
    },
    30062: {
      name_i18n: {
        ko: '장치',
        ja: '初級装置',
        en: 'Device',
        cn: '装置'
      }
    },
    30063: {
      name_i18n: {
        ko: '리뉴얼 장치',
        ja: '中級装置',
        en: 'Integrated Device',
        cn: '全新装置'
      }
    },
    30064: {
      name_i18n: {
        ko: '개량 장치',
        ja: '上級装置',
        en: 'Optimized Device',
        cn: '改量装置'
      }
    },
    30031: {
      name_i18n: {
        ko: '에스테르 원료',
        ja: 'エステル原料',
        en: 'Ester',
        cn: '酯原料'
      }
    },
    30032: {
      name_i18n: {
        ko: '폴리에스테르',
        ja: '初級エステル',
        en: 'Polyester',
        cn: '聚酸酯'
      }
    },
    30033: {
      name_i18n: {
        ko: '폴리에스테르 번들',
        ja: '中級エステル',
        en: 'Polyester Pack',
        cn: '聚酸酯组'
      }
    },
    30034: {
      name_i18n: {
        ko: '폴리에스테르 팩',
        ja: '上級エステル',
        en: 'Polyester Lump',
        cn: '聚酸酯块'
      }
    },
    30021: {
      name_i18n: {
        ko: '대체당',
        ja: 'ブドウ糖',
        en: 'Sugar Substitute',
        cn: '代糖'
      }
    },
    30022: {
      name_i18n: {
        ko: '포도당',
        ja: '初級糖原',
        en: 'Sugar',
        cn: '糖'
      }
    },
    30023: {
      name_i18n: {
        ko: '포도당 번들',
        ja: '中級糖原',
        en: 'Sugar Pack',
        cn: '糖组'
      }
    },
    30024: {
      name_i18n: {
        ko: '포도당 팩',
        ja: '高級糖原',
        en: 'Sugar Lump',
        cn: '糖聚块'
      }
    },
    30041: {
      name_i18n: {
        ko: '이철 조각',
        ja: '異鉄の欠片',
        en: 'Oriron Shard',
        cn: '异铁碎片'
      }
    },
    30042: {
      name_i18n: {
        ko: '이철',
        ja: '初級異鉄',
        en: 'Oriron',
        cn: '异铁'
      }
    },
    30043: {
      name_i18n: {
        ko: '이철 번들',
        ja: '中級異鉄',
        en: 'Oriron Cluster',
        cn: '异铁组'
      }
    },
    30044: {
      name_i18n: {
        ko: '이철 팩',
        ja: '高級異鉄',
        en: 'Oriron Block',
        cn: '异铁块'
      }
    },
    30051: {
      name_i18n: {
        ko: '디케톤',
        ja: 'アケトン試剤',
        en: 'Diketon',
        cn: '双酮'
      }
    },
    30052: {
      name_i18n: {
        ko: '아케톤 응집체',
        ja: '初級アケトン',
        en: 'Polyketon',
        cn: '酮凝集'
      }
    },
    30053: {
      name_i18n: {
        ko: '아케톤 응집체 번들',
        ja: '中級アケトン',
        en: 'Aketon',
        cn: '酮凝集组'
      }
    },
    30054: {
      name_i18n: {
        ko: '아케톤 팩',
        ja: '高級アケトン',
        en: 'Keton Colloid',
        cn: '酮阵列'
      }
    },
    30073: {
      name_i18n: {
        ko: '로식 콜',
        ja: '合成コール',
        en: 'Loxic Kohl',
        cn: '扭转醇'
      }
    },
    30074: {
      name_i18n: {
        ko: '화이트 호스 콜',
        ja: '上級合成コール',
        en: 'White Horse Kohl',
        cn: '白马醇'
      }
    },
    30083: {
      name_i18n: {
        ko: '망간 광석',
        ja: 'マンガン',
        en: 'Manganese Ore',
        cn: '轻锰矿'
      }
    },
    30084: {
      name_i18n: {
        ko: '망간 중합체',
        ja: '上級マンガン',
        en: 'Manganese Trihydrate',
        cn: '三水锰矿'
      }
    },
    30093: {
      name_i18n: {
        ko: '연마석',
        ja: '砥石',
        en: 'Grindstone',
        cn: '研磨石'
      }
    },
    30094: {
      name_i18n: {
        ko: '고급연마석',
        ja: '上級砥石',
        en: 'Grindstone Pentahydrate',
        cn: '五水研磨石'
      }
    },
    30103: {
      name_i18n: {
        ko: 'RMA70-12',
        ja: 'RMA70-12',
        en: 'RMA70-12',
        cn: 'RMA70-12'
      }
    },
    30104: {
      name_i18n: {
        ko: 'RMA70-24',
        ja: 'RMA70-24',
        en: 'RMA70-24',
        cn: 'RMA70-24'
      }
    },
    3112: {
      name_i18n: {
        ko: '카본',
        ja: '初級炭素材',
        en: 'Carbon Stick',
        cn: '碳'
      }
    },
    3113: {
      name_i18n: {
        ko: '카본 번들',
        ja: '中級炭素材',
        en: 'Carbon Brick',
        cn: '碳素'
      }
    },
    3114: {
      name_i18n: {
        ko: '카본 팩',
        ja: '上級炭素材',
        en: 'Carbon Brick',
        cn: '碳素组'
      }
    },
    3301: {
      name_i18n: {
        ko: '스킬개론 제1권',
        ja: 'アーツ学Ⅰ',
        en: 'Skill Summary - 1',
        cn: '技巧概要·卷1'
      }
    },
    3302: {
      name_i18n: {
        ko: '스킬개론 제2권',
        ja: 'アーツ学Ⅱ',
        en: 'Skill Summary - 2',
        cn: '技巧概要·卷2'
      }
    },
    3303: {
      name_i18n: {
        ko: '스킬개론 제3권',
        ja: 'アーツ学Ⅲ',
        en: 'Skill Summary - 3',
        cn: '技巧概要·卷3'
      }
    },
    31013: {
      name_i18n: {
        ko: '젤',
        ja: '人工ゲル',
        en: 'Coagulating Gel',
        cn: '凝胶'
      }
    },
    31014: {
      name_i18n: {
        ko: '중합젤',
        ja: '融合ゲル',
        en: 'Polymerized Gel',
        cn: '聚合凝胶'
      }
    },
    31023: {
      name_i18n: {
        ko: '열합금',
        ja: '熾合金',
        en: 'Incandescent Alloy',
        cn: '炽合金'
      }
    },
    31024: {
      name_i18n: {
        ko: '열합금 팩',
        ja: '上級熾合金',
        en: 'Incandescent Alloy Block',
        cn: '炽合金块'
      }
    },
    randomMaterial_1: {
      name_i18n: {
        ko: '로도스 아일랜드 보급 물자',
        ja: '補給物資・ロドス',
        en: 'Rhodes Island Supplies',
        cn: '罗德岛物资补给'
      }
    },
    ap_supply_lt_010: {
      name_i18n: {
        ko: '응급 이성 샘플',
        ja: '試供理性回復剤',
        en: 'Emergency Sanity Sampler',
        cn: '应急理智小样'
      }
    },
    randomMaterial_2: {
      name_i18n: {
        ko: '축제 등불',
        ja: '年関ランタン',
        en: "New Year's Lantern",
        cn: '岁过华灯'
      }
    },
    4005: {
      name_i18n: {
        ko: '자격증명서',
        ja: '一般資格証',
        en: 'Commendation Certificate',
        cn: '资质凭证'
      }
    },
    30115: {
      name_i18n: {
        ko: '중합제',
        ja: '融合剤',
        en: 'Polymerization Preparation',
        cn: '聚合剂'
      }
    },
    30125: {
      name_i18n: {
        ko: '바이폴라 나노플레이크 칩',
        ja: 'ナノフレーク',
        en: 'Bipolar Nanoflake',
        cn: '双极纳米片'
      }
    },
    30135: {
      name_i18n: {
        ko: 'D32강',
        ja: 'D32鋼',
        en: 'D32 Steel',
        cn: 'D32钢'
      }
    },
    randomMaterial_3: {
      name_i18n: {
        ko: '32h 전략 보급',
        ja: '32h戦略補給',
        en: '32-hour Strategic Ration',
        cn: '32h战略配给'
      }
    },
    randomMaterial_4: {
      name_i18n: {
        ko: '感谢庆典物资补给',
        ja: '感谢庆典物资补给',
        en: '感谢庆典物资补给',
        cn: '感谢庆典物资补给'
      }
    },
    31033: {
      name_i18n: {
        ko: '晶体元件',
        ja: '晶体元件',
        en: '晶体元件',
        cn: '晶体元件'
      }
    },
    31034: {
      name_i18n: {
        ko: '晶体电路',
        ja: '晶体电路',
        en: '晶体电路',
        cn: '晶体电路'
      }
    },
    30145: {
      name_i18n: {
        ko: '晶体电子单元',
        ja: '晶体电子单元',
        en: '晶体电子单元',
        cn: '晶体电子单元'
      }
    },
    3211: {
      name_i18n: {
        ko: '뱅가드 칩',
        ja: '初級先鋒SoC',
        en: 'Vanguard Chip',
        cn: '先锋芯片'
      }
    },
    3221: {
      name_i18n: {
        ko: '가드 칩',
        ja: '初級前衛SoC',
        en: 'Guard Chip',
        cn: '近卫芯片'
      }
    },
    3241: {
      name_i18n: {
        ko: '스나이퍼 칩',
        ja: '初級狙撃SoC',
        en: 'Sniper Chip',
        cn: '狙击芯片'
      }
    },
    3231: {
      name_i18n: {
        ko: '디펜더 칩',
        ja: '初級重装SoC',
        en: 'Defender Chip',
        cn: '重装芯片'
      }
    },
    3261: {
      name_i18n: {
        ko: '메딕 칩',
        ja: '初級医療SoC',
        en: 'Medic Chip',
        cn: '医疗芯片'
      }
    },
    3271: {
      name_i18n: {
        ko: '서포터 칩',
        ja: '初級補助SoC',
        en: 'Supporter Chip',
        cn: '辅助芯片'
      }
    },
    3251: {
      name_i18n: {
        ko: '캐스터 칩',
        ja: '初級術師SoC',
        en: 'Caster Chip',
        cn: '术师芯片'
      }
    },
    3281: {
      name_i18n: {
        ko: '스페셜리스트 칩',
        ja: '初級特殊SoC',
        en: 'Specialist Chip',
        cn: '特种芯片'
      }
    },
    3212: {
      name_i18n: {
        ko: '뱅가드 칩셋',
        ja: '中級先鋒SoC',
        en: 'Vanguard Chip Pack',
        cn: '先锋芯片组'
      }
    },
    3222: {
      name_i18n: {
        ko: '가드 칩셋',
        ja: '中級前衛SoC',
        en: 'Guard Chip Pack',
        cn: '近卫芯片组'
      }
    },
    3242: {
      name_i18n: {
        ko: '스나이퍼 칩셋',
        ja: '中級狙撃SoC',
        en: 'Sniper Chip Pack',
        cn: '狙击芯片组'
      }
    },
    3232: {
      name_i18n: {
        ko: '디펜더 칩셋',
        ja: '中級重装SoC',
        en: 'Defender Chip Pack',
        cn: '重装芯片组'
      }
    },
    3262: {
      name_i18n: {
        ko: '메딕 칩셋',
        ja: '中級医療SoC',
        en: 'Medic Chip Pack',
        cn: '医疗芯片组'
      }
    },
    3272: {
      name_i18n: {
        ko: '서포터 칩셋',
        ja: '中級補助SoC',
        en: 'Supporter Chip Pack',
        cn: '辅助芯片组'
      }
    },
    3252: {
      name_i18n: {
        ko: '캐스터 칩셋',
        ja: '中級術師SoC',
        en: 'Caster Chip Pack',
        cn: '术师芯片组'
      }
    },
    3282: {
      name_i18n: {
        ko: '스페셜리스트 칩셋',
        ja: '中級特殊SoC',
        en: 'Specialist Chip Pack',
        cn: '特种芯片组'
      }
    }
  },
  stage: {
    '0-1': {
      stageId: 'main_00-01',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30051',
        '30061',
        '3003',
        '2001',
        '30041'
      ]
    },
    '0-2': {
      stageId: 'main_00-02',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-3': {
      stageId: 'main_00-03',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-4': {
      stageId: 'main_00-04',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30061',
        '3003',
        '2001',
        '30051'
      ]
    },
    '0-5': {
      stageId: 'main_00-05',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-6': {
      stageId: 'main_00-06',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-7': {
      stageId: 'main_00-07',
      drops: [
        '30021',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-8': {
      stageId: 'main_00-08',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-9': {
      stageId: 'main_00-09',
      drops: [
        '30011',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '0-10': {
      stageId: 'main_00-10',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '2001',
        '3003'
      ]
    },
    '0-11': {
      stageId: 'main_00-11',
      drops: [
        '30011',
        '30031',
        '30031',
        '30041',
        '30021',
        '30061',
        '3003',
        '2001',
        '30051'
      ]
    },
    '1-1': {
      stageId: 'main_01-01',
      drops: [
        '30011',
        '30031',
        '30041',
        '30021',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '1-2': {
      stageId: 'main_01-02',
      drops: []
    },
    '1-3': {
      stageId: 'main_01-03',
      drops: [
        '30041',
        '30011',
        '30021',
        '30031',
        '30041',
        '30061',
        '3003',
        '2001',
        '30051'
      ]
    },
    '1-4': {
      stageId: 'main_01-04',
      drops: [
        '30011',
        '30021',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001',
        '30031'
      ]
    },
    '1-5': {
      stageId: 'main_01-05',
      drops: [
        '30061',
        '30011',
        '30031',
        '30041',
        '30051',
        '30061',
        '30021',
        '3003',
        '2001'
      ]
    },
    '1-6': {
      stageId: 'main_01-06',
      drops: [
        '30051',
        '30011',
        '30021',
        '30031',
        '30041',
        '30061',
        '3003',
        '2001',
        '30051'
      ]
    },
    '1-7': {
      stageId: 'main_01-07',
      drops: [
        '30012',
        '30011',
        '30021',
        '30031',
        '30051',
        '30041',
        '30061',
        '3003',
        '2001'
      ]
    },
    '1-8': {
      stageId: 'main_01-08',
      drops: [
        '30032',
        '30021',
        '30031',
        '30011',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '1-9': {
      stageId: 'main_01-09',
      drops: [
        '3112',
        '30021',
        '30011',
        '30031',
        '30051',
        '30041',
        '30061',
        '3003',
        '2001'
      ]
    },
    '1-10': {
      stageId: 'main_01-10',
      drops: [
        '3301',
        '30011',
        '30021',
        '30031',
        '30041',
        '30061',
        '30051',
        '3003',
        '2001'
      ]
    },
    '1-11': {
      stageId: 'main_01-11',
      drops: []
    },
    '1-12': {
      stageId: 'main_01-12',
      drops: [
        '30062',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '2-1': {
      stageId: 'main_02-01',
      drops: [
        '30042',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    '2-2': {
      stageId: 'main_02-02',
      drops: [
        '30022',
        '30011',
        '30021',
        '30031',
        '30051',
        '30041',
        '3003',
        '2001',
        '30061'
      ]
    },
    '2-3': {
      stageId: 'main_02-03',
      drops: [
        '30061',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30062',
        '2001',
        '30032'
      ]
    },
    '2-4': {
      stageId: 'main_02-04',
      drops: [
        '30013',
        '30031',
        '30011',
        '30061',
        '30012',
        '3003',
        '30062',
        '2001',
        '30032'
      ]
    },
    '2-5': {
      stageId: 'main_02-05',
      drops: [
        '30023',
        '30041',
        '30021',
        '30051',
        '2001',
        '30022',
        '30052',
        '30042',
        '2002'
      ]
    },
    '2-6': {
      stageId: 'main_02-06',
      drops: [
        '30033',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062',
        '2001'
      ]
    },
    '2-7': {
      stageId: 'main_02-07',
      drops: [
        '30021',
        '30041',
        '30051',
        '2001',
        '30022',
        '30042',
        '30052',
        '2002'
      ]
    },
    '2-8': {
      stageId: 'main_02-08',
      drops: [
        '30043',
        '30021',
        '30041',
        '30051',
        '30022',
        '30042',
        '30052',
        '2002',
        '2001'
      ]
    },
    '2-9': {
      stageId: 'main_02-09',
      drops: [
        '30073',
        '30011',
        '30031',
        '3003',
        '30012',
        '30032',
        '30062',
        '30061',
        '2001'
      ]
    },
    '2-10': {
      stageId: 'main_02-10',
      drops: [
        '30103',
        '30021',
        '30041',
        '30051',
        '30022',
        '2001',
        '30042',
        '2002',
        '30052'
      ]
    },
    'S2-1': {
      stageId: 'sub_02-01',
      drops: [
        '30052',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '3003',
        '2001',
        '30061'
      ]
    },
    'S2-2': {
      stageId: 'sub_02-02',
      drops: [
        '30011',
        '30021',
        '30031',
        '30041',
        '30061',
        '3003',
        '2001',
        '30051'
      ]
    },
    'S2-3': {
      stageId: 'sub_02-03',
      drops: [
        '2001',
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    'S2-4': {
      stageId: 'sub_02-04',
      drops: [
        '30011',
        '30021',
        '30031',
        '30041',
        '30051',
        '30061',
        '3003',
        '2001'
      ]
    },
    'S2-5': {
      stageId: 'sub_02-05',
      drops: [
        '30011',
        '30011',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062',
        '2001',
        '30031'
      ]
    },
    'S2-6': {
      stageId: 'sub_02-06',
      drops: [
        '30021',
        '30021',
        '30051',
        '2001',
        '30041',
        '30022',
        '30042',
        '2002',
        '30052'
      ]
    },
    'S2-7': {
      stageId: 'sub_02-07',
      drops: [
        '30031',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062',
        '2001'
      ]
    },
    'S2-8': {
      stageId: 'sub_02-08',
      drops: [
        '30041',
        '30021',
        '30051',
        '30041',
        '30022',
        '2001',
        '30042',
        '2002',
        '30052'
      ]
    },
    'S2-9': {
      stageId: 'sub_02-09',
      drops: [
        '30051',
        '30021',
        '30051',
        '30041',
        '2001',
        '30022',
        '30042',
        '30052',
        '2002'
      ]
    },
    'S2-10': {
      stageId: 'sub_02-10',
      drops: [
        '2002',
        '30011',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062',
        '2001',
        '30031'
      ]
    },
    'S2-11': {
      stageId: 'sub_02-11',
      drops: [
        '30021',
        '30041',
        '30051',
        '2001',
        '30022',
        '30042',
        '30052',
        '2002'
      ]
    },
    'S2-12': {
      stageId: 'sub_02-12',
      drops: [
        '30012',
        '30011',
        '30031',
        '30061',
        '3003',
        '30032',
        '30062',
        '30012'
      ]
    },
    '3-1': {
      stageId: 'main_03-01',
      drops: [
        '30053',
        '30021',
        '30041',
        '30051',
        '2001',
        '30022',
        '30042',
        '30052',
        '2002'
      ]
    },
    '3-2': {
      stageId: 'main_03-02',
      drops: [
        '30083',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062'
      ]
    },
    '3-3': {
      stageId: 'main_03-03',
      drops: [
        '30093',
        '30011',
        '30031',
        '30061',
        '30012',
        '3003',
        '30032',
        '30062'
      ]
    },
    '3-4': {
      stageId: 'main_03-04',
      drops: [
        '30063',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062'
      ]
    },
    '3-5': {
      stageId: 'main_03-05',
      drops: [
        '2002',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062'
      ]
    },
    '3-6': {
      stageId: 'main_03-06',
      drops: [
        '30021',
        '30041',
        '30051',
        '30022',
        '2001',
        '30042',
        '30052',
        '2002'
      ]
    },
    '3-7': {
      stageId: 'main_03-07',
      drops: [
        '30052',
        '30021',
        '30041',
        '30051',
        '2001',
        '30022',
        '30042',
        '2002',
        '30052'
      ]
    },
    '3-8': {
      stageId: 'main_03-08',
      drops: [
        '30033',
        '30034',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '30031',
        '31033'
      ]
    },
    'S3-1': {
      stageId: 'sub_03-1-1',
      drops: [
        '30022',
        '30021',
        '30041',
        '30051',
        '2001',
        '30022',
        '30042',
        '30052',
        '2002'
      ]
    },
    'S3-2': {
      stageId: 'sub_03-1-2',
      drops: [
        '30011',
        '30032',
        '30031',
        '30061',
        '3003',
        '30012',
        '30062',
        '30032'
      ]
    },
    'S3-3': {
      stageId: 'sub_03-2-1',
      drops: [
        '30021',
        '30041',
        '30051',
        '30042',
        '2001',
        '30042',
        '30052',
        '30022',
        '2002'
      ]
    },
    'S3-4': {
      stageId: 'sub_03-2-2',
      drops: [
        '30062',
        '30011',
        '30031',
        '30061',
        '30012',
        '3003',
        '30032',
        '30062'
      ]
    },
    'S3-5': {
      stageId: 'sub_03-2-3',
      drops: [
        '30021',
        '30051',
        '30041',
        '2001',
        '30022',
        '30052',
        '30042',
        '2002'
      ]
    },
    '4-1': {
      stageId: 'main_04-01',
      drops: [
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    '4-2': {
      stageId: 'main_04-02',
      drops: [
        '30023',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003',
        '30024'
      ]
    },
    '4-3': {
      stageId: 'main_04-03',
      drops: [
        '2003',
        '30011',
        '30012',
        '30062',
        '30061',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    '4-4': {
      stageId: 'main_04-04',
      drops: [
        '30073',
        '30074',
        '30011',
        '30061',
        '30012',
        '30062',
        '30063',
        '30013',
        '31013',
        '3003',
        '30073'
      ]
    },
    '4-5': {
      stageId: 'main_04-05',
      drops: [
        '30053',
        '30054',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30093',
        '30053',
        '30103',
        '31033'
      ]
    },
    '4-6': {
      stageId: 'main_04-06',
      drops: [
        '30013',
        '30014',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '31013',
        '30073',
        '3003'
      ]
    },
    '4-7': {
      stageId: 'main_04-07',
      drops: [
        '30083',
        '30084',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    '4-8': {
      stageId: 'main_04-08',
      drops: [
        '30093',
        '30094',
        '30051',
        '30031',
        '30032',
        '30033',
        '30052',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '4-9': {
      stageId: 'main_04-09',
      drops: [
        '30103',
        '30104',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '4-10': {
      stageId: 'main_04-10',
      drops: [
        '30063',
        '30064',
        '30011',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003',
        '30061'
      ]
    },
    'S4-1': {
      stageId: 'sub_04-1-1',
      drops: [
        '30043',
        '30044',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'S4-2': {
      stageId: 'sub_04-1-2',
      drops: [
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    'S4-3': {
      stageId: 'sub_04-1-3',
      drops: [
        '30021',
        '30041',
        '2001',
        '30022',
        '2002',
        '30042',
        '30023',
        '30043',
        '31023',
        '30083',
        '2003'
      ]
    },
    'S4-4': {
      stageId: 'sub_04-2-1',
      drops: [
        '30021',
        '30041',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003',
        '2001'
      ]
    },
    'S4-5': {
      stageId: 'sub_04-2-2',
      drops: [
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30093',
        '30103',
        '30053',
        '31033'
      ]
    },
    'S4-6': {
      stageId: 'sub_04-2-3',
      drops: [
        '30021',
        '2001',
        '30041',
        '30022',
        '2002',
        '30042',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'S4-7': {
      stageId: 'sub_04-3-1',
      drops: [
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'S4-8': {
      stageId: 'sub_04-3-2',
      drops: [
        '30031',
        '30032',
        '30052',
        '30051',
        '30033',
        '30093',
        '30103',
        '30053',
        '31033'
      ]
    },
    'S4-9': {
      stageId: 'sub_04-3-3',
      drops: [
        '2003',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'GT-1': {
      stageId: 'a001_01_rep',
      drops: []
    },
    'GT-2': {
      stageId: 'a001_02_rep',
      drops: []
    },
    'GT-3': {
      stageId: 'a001_03_rep',
      drops: []
    },
    'GT-4': {
      stageId: 'a001_04_rep',
      drops: []
    },
    'GT-5': {
      stageId: 'a001_05_rep',
      drops: []
    },
    'GT-6': {
      stageId: 'a001_06_rep',
      drops: []
    },
    'SK-1': {
      stageId: 'wk_armor_1',
      drops: [
        '3112'
      ]
    },
    'SK-2': {
      stageId: 'wk_armor_2',
      drops: [
        '3112'
      ]
    },
    'SK-3': {
      stageId: 'wk_armor_3',
      drops: [
        '3112',
        '3113'
      ]
    },
    'SK-4': {
      stageId: 'wk_armor_4',
      drops: [
        '3114',
        '3113'
      ]
    },
    'SK-5': {
      stageId: 'wk_armor_5',
      drops: [
        '3114',
        '3113'
      ]
    },
    'CA-1': {
      stageId: 'wk_fly_1',
      drops: [
        '3301'
      ]
    },
    'CA-2': {
      stageId: 'wk_fly_2',
      drops: [
        '3301'
      ]
    },
    'CA-3': {
      stageId: 'wk_fly_3',
      drops: [
        '3302',
        '3301'
      ]
    },
    'CA-4': {
      stageId: 'wk_fly_4',
      drops: [
        '3303',
        '3302',
        '3301'
      ]
    },
    'CA-5': {
      stageId: 'wk_fly_5',
      drops: [
        '3303',
        '3301',
        '3302'
      ]
    },
    '5-1': {
      stageId: 'main_05-01',
      drops: [
        '30013',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30073',
        '30063',
        '31013',
        '3003'
      ]
    },
    '5-2': {
      stageId: 'main_05-02',
      drops: [
        '30023',
        '30024',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    '5-3': {
      stageId: 'main_05-03',
      drops: [
        '30033',
        '30022'
      ]
    },
    '5-4': {
      stageId: 'main_05-04',
      drops: [
        '30031',
        '30073',
        '30051',
        '30032',
        '30052',
        '30033',
        '30093',
        '30103',
        '30053',
        '31033'
      ]
    },
    '5-5': {
      stageId: 'main_05-05',
      drops: [
        '30043',
        '30044',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30073',
        '31013',
        '3003',
        '30063'
      ]
    },
    '5-6': {
      stageId: 'main_05-06',
      drops: [
        '30021',
        '30083',
        '2001',
        '30041',
        '30022',
        '2002',
        '30042',
        '30023',
        '30043',
        '30083',
        '2003',
        '31023'
      ]
    },
    '5-7': {
      stageId: 'main_05-07',
      drops: [
        '30093',
        '30042'
      ]
    },
    '5-8': {
      stageId: 'main_05-08',
      drops: [
        '30053',
        '30054',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '5-9': {
      stageId: 'main_05-09',
      drops: [
        '30103',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    '5-10': {
      stageId: 'main_05-10',
      drops: [
        '30063',
        '30012'
      ]
    },
    'S5-1': {
      stageId: 'sub_05-1-1',
      drops: [
        '2003',
        '30012'
      ]
    },
    'S5-2': {
      stageId: 'sub_05-1-2',
      drops: [
        '30021',
        '30041',
        '2001',
        '30042',
        '2002',
        '30023',
        '30022',
        '30043',
        '31023',
        '2003',
        '30083'
      ]
    },
    'S5-3': {
      stageId: 'sub_05-2-1',
      drops: [
        '30032'
      ]
    },
    'S5-4': {
      stageId: 'sub_05-2-2',
      drops: [
        '2003',
        '30022'
      ]
    },
    'S5-5': {
      stageId: 'sub_05-3-1',
      drops: [
        '30062'
      ]
    },
    'S5-6': {
      stageId: 'sub_05-3-2',
      drops: [
        '2003',
        '30041',
        '2001',
        '30021',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'OF-1': {
      stageId: 'a003_01',
      drops: []
    },
    'OF-2': {
      stageId: 'a003_02',
      drops: []
    },
    'OF-3': {
      stageId: 'a003_03',
      drops: []
    },
    'OF-4': {
      stageId: 'a003_04',
      drops: []
    },
    'OF-5': {
      stageId: 'a003_05',
      drops: []
    },
    'OF-6': {
      stageId: 'a003_06',
      drops: []
    },
    'OF-7': {
      stageId: 'a003_07',
      drops: []
    },
    'OF-8': {
      stageId: 'a003_08',
      drops: []
    },
    'OF-F1': {
      stageId: 'a003_f01',
      drops: []
    },
    'OF-F2': {
      stageId: 'a003_f02',
      drops: []
    },
    'OF-F3': {
      stageId: 'a003_f03',
      drops: []
    },
    'OF-F4': {
      stageId: 'a003_f04',
      drops: []
    },
    奖励扭蛋机: {
      stageId: 'gachabox6',
      drops: []
    },
    'SW-EV-1': {
      stageId: 'act4d0_01',
      drops: []
    },
    'SW-EV-2': {
      stageId: 'act4d0_02',
      drops: []
    },
    'SW-EV-3': {
      stageId: 'act4d0_03',
      drops: []
    },
    'SW-EV-4': {
      stageId: 'act4d0_04',
      drops: []
    },
    'SW-EV-5': {
      stageId: 'act4d0_05',
      drops: []
    },
    'CB-1': {
      stageId: 'act5d0_01_rep',
      drops: []
    },
    'CB-2': {
      stageId: 'act5d0_02_rep',
      drops: []
    },
    'CB-3': {
      stageId: 'act5d0_03_rep',
      drops: []
    },
    'CB-4': {
      stageId: 'act5d0_04_rep',
      drops: []
    },
    'CB-5': {
      stageId: 'act5d0_05_rep',
      drops: []
    },
    'CB-6': {
      stageId: 'act5d0_06_rep',
      drops: []
    },
    'CB-7': {
      stageId: 'act5d0_07_rep',
      drops: []
    },
    'CB-8': {
      stageId: 'act5d0_08_rep',
      drops: []
    },
    'CB-9': {
      stageId: 'act5d0_09_rep',
      drops: []
    },
    'CB-10': {
      stageId: 'act5d0_10_rep',
      drops: []
    },
    '6-1': {
      stageId: 'main_06-01',
      drops: [
        '30042'
      ]
    },
    '6-2': {
      stageId: 'main_06-02',
      drops: [
        '30083',
        '30031',
        '30051',
        '30032',
        '30052',
        '30084',
        '30053',
        '30033',
        '30093',
        '30103',
        '31033'
      ]
    },
    '6-3': {
      stageId: 'main_06-03',
      drops: [
        '30023',
        '30011',
        '30061',
        '30062',
        '30013',
        '30063',
        '30073',
        '30012',
        '3003',
        '31013'
      ]
    },
    '6-4': {
      stageId: 'main_06-04',
      drops: [
        '30033',
        '30034',
        '30031',
        '30051',
        '30032',
        '30033',
        '30053',
        '30093',
        '30103',
        '30052',
        '31033'
      ]
    },
    '6-5': {
      stageId: 'main_06-05',
      drops: [
        '30013',
        '30032'
      ]
    },
    '6-7': {
      stageId: 'main_06-06',
      drops: []
    },
    '6-8': {
      stageId: 'main_06-07',
      drops: [
        '30053',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30083',
        '31023',
        '2003',
        '30043'
      ]
    },
    '6-9': {
      stageId: 'main_06-08',
      drops: [
        '30032',
        '2003'
      ]
    },
    '6-10': {
      stageId: 'main_06-09',
      drops: [
        '30043',
        '30031',
        '30051',
        '30052',
        '30032',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '6-11': {
      stageId: 'main_06-10',
      drops: [
        '30062',
        '30073'
      ]
    },
    '6-12': {
      stageId: 'main_06-11',
      drops: [
        '31023',
        '31024',
        '30021',
        '30041',
        '2001',
        '30022',
        '2002',
        '30042',
        '30043',
        '30083',
        '31023',
        '2003',
        '30023'
      ]
    },
    '6-14': {
      stageId: 'main_06-12',
      drops: [
        '30011',
        '30093',
        '30061',
        '30012',
        '30062',
        '30013',
        '30073',
        '30063',
        '31013',
        '3003'
      ]
    },
    '6-15': {
      stageId: 'main_06-13',
      drops: [
        '30103',
        '30104',
        '30031',
        '30051',
        '30032',
        '30052',
        '30053',
        '30093',
        '30103',
        '30033',
        '31033'
      ]
    },
    '6-16': {
      stageId: 'main_06-14',
      drops: [
        '30063',
        '30052'
      ]
    },
    '6-17': {
      stageId: 'main_06-15',
      drops: []
    },
    'S3-6': {
      stageId: 'sub_03-3-1',
      drops: [
        '31023',
        '30011',
        '30031',
        '30061',
        '3003',
        '30012',
        '30032',
        '30062'
      ]
    },
    'S4-10': {
      stageId: 'sub_04-4-1',
      drops: [
        '31013',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    'S5-7': {
      stageId: 'sub_05-4-1',
      drops: [
        '31013',
        '31014',
        '30051',
        '30032',
        '30031',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    'S5-8': {
      stageId: 'sub_05-4-2',
      drops: [
        '31023',
        '31024',
        '30011',
        '30012',
        '30061',
        '30062',
        '30063',
        '30013',
        '30073',
        '31013',
        '3003'
      ]
    },
    'S6-1': {
      stageId: 'sub_06-1-1',
      drops: [
        '2003',
        '30031',
        '30032',
        '30051',
        '30052',
        '30033',
        '30053',
        '30103',
        '30093',
        '31033'
      ]
    },
    'S6-2': {
      stageId: 'sub_06-1-2',
      drops: [
        '30012'
      ]
    },
    'S6-3': {
      stageId: 'sub_06-2-1',
      drops: [
        '30052',
        '2003'
      ]
    },
    'S6-4': {
      stageId: 'sub_06-2-2',
      drops: [
        '30051',
        '30032',
        '30031',
        '30052',
        '30033',
        '30093',
        '30103',
        '30053',
        '31033'
      ]
    },
    罗德岛物资补给: {
      stageId: 'randomMaterial_1',
      drops: [
        '30011',
        '30021',
        '30031',
        '30051',
        '30041',
        '30061',
        '30022',
        '30032',
        '30012',
        '30042',
        '30052',
        '30062',
        '30023',
        '30013',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'AF-1': {
      stageId: 'act6d5_01',
      drops: []
    },
    'AF-2': {
      stageId: 'act6d5_02',
      drops: []
    },
    'AF-3': {
      stageId: 'act6d5_03',
      drops: []
    },
    'AF-4': {
      stageId: 'act6d5_04',
      drops: []
    },
    'AF-5': {
      stageId: 'act6d5_05',
      drops: []
    },
    'AF-6': {
      stageId: 'act6d5_06',
      drops: []
    },
    'AF-7': {
      stageId: 'act6d5_07',
      drops: []
    },
    'AF-8': {
      stageId: 'act6d5_08',
      drops: []
    },
    岁过华灯: {
      stageId: 'randomMaterial_2',
      drops: [
        '30011',
        '30031',
        '30021',
        '30041',
        '30051',
        '30061',
        '30022',
        '30032',
        '30042',
        '30052',
        '30062',
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30012',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'CE-1': {
      stageId: 'wk_melee_1',
      drops: []
    },
    'CE-2': {
      stageId: 'wk_melee_2',
      drops: []
    },
    'CE-3': {
      stageId: 'wk_melee_3',
      drops: []
    },
    'CE-4': {
      stageId: 'wk_melee_4',
      drops: []
    },
    'CE-5': {
      stageId: 'wk_melee_5',
      drops: []
    },
    'AP-1': {
      stageId: 'wk_toxic_1',
      drops: []
    },
    'AP-2': {
      stageId: 'wk_toxic_2',
      drops: []
    },
    'AP-3': {
      stageId: 'wk_toxic_3',
      drops: []
    },
    'AP-4': {
      stageId: 'wk_toxic_4',
      drops: []
    },
    'AP-5': {
      stageId: 'wk_toxic_5',
      drops: []
    },
    'SA-1': {
      stageId: 'act7d5_01',
      drops: []
    },
    'SA-2': {
      stageId: 'act7d5_02',
      drops: []
    },
    'SA-3': {
      stageId: 'act7d5_03',
      drops: []
    },
    'SA-4': {
      stageId: 'act7d5_04',
      drops: []
    },
    'SA-5': {
      stageId: 'act7d5_05',
      drops: []
    },
    'SA-6': {
      stageId: 'act7d5_06',
      drops: []
    },
    荒芜行动物资补给: {
      stageId: 'randomMaterialRune_0',
      drops: [
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'DM-1': {
      stageId: 'act9d0_01',
      drops: []
    },
    'DM-2': {
      stageId: 'act9d0_02',
      drops: []
    },
    'DM-3': {
      stageId: 'act9d0_03',
      drops: []
    },
    'DM-4': {
      stageId: 'act9d0_04',
      drops: []
    },
    'DM-5': {
      stageId: 'act9d0_05',
      drops: []
    },
    'DM-6': {
      stageId: 'act9d0_06',
      drops: []
    },
    'DM-7': {
      stageId: 'act9d0_07',
      drops: []
    },
    'DM-8': {
      stageId: 'act9d0_08',
      drops: []
    },
    '7-2': {
      stageId: 'main_07-01',
      drops: [
        '30013',
        '30014',
        '30031',
        '30051',
        '30032',
        '30033',
        '30052',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '7-3': {
      stageId: 'main_07-02',
      drops: [
        '30022'
      ]
    },
    '7-4': {
      stageId: 'main_07-03',
      drops: [
        '30033',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    '7-5': {
      stageId: 'main_07-04',
      drops: [
        '30073',
        '30074',
        '30031',
        '30051',
        '30052',
        '30032',
        '30033',
        '30093',
        '30053',
        '30103',
        '31033'
      ]
    },
    '7-6': {
      stageId: 'main_07-05',
      drops: [
        '30013',
        '30022'
      ]
    },
    '7-8': {
      stageId: 'main_07-06',
      drops: [
        '31013',
        '31014',
        '30021',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '30041',
        '2003',
        '31023'
      ]
    },
    '7-9': {
      stageId: 'main_07-07',
      drops: [
        '30063',
        '30064',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '7-10': {
      stageId: 'main_07-08',
      drops: [
        '30103',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '30103',
        '31033'
      ]
    },
    '7-11': {
      stageId: 'main_07-09',
      drops: [
        '30042',
        '2003'
      ]
    },
    '7-12': {
      stageId: 'main_07-10',
      drops: [
        '30023',
        '30052'
      ]
    },
    '7-13': {
      stageId: 'main_07-11',
      drops: [
        '30011',
        '2003',
        '30061',
        '30062',
        '30013',
        '30012',
        '30063',
        '31013',
        '30073',
        '3003'
      ]
    },
    '7-14': {
      stageId: 'main_07-12',
      drops: [
        '30053',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30093',
        '30053',
        '30103',
        '31033'
      ]
    },
    '7-15': {
      stageId: 'main_07-13',
      drops: [
        '30063',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '31023',
        '30083',
        '2003'
      ]
    },
    '7-16': {
      stageId: 'main_07-14',
      drops: [
        '30012',
        '30083'
      ]
    },
    '7-17': {
      stageId: 'main_07-15',
      drops: [
        '30093',
        '30094',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    '7-18': {
      stageId: 'main_07-16',
      drops: [
        '30043',
        '30052'
      ]
    },
    'S7-1': {
      stageId: 'sub_07-1-1',
      drops: [
        '30011',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003',
        '30061'
      ]
    },
    'S7-2': {
      stageId: 'sub_07-1-2',
      drops: [
        '30052'
      ]
    },
    '32h战略配给': {
      stageId: 'randomMaterial_3',
      drops: [
        '30012',
        '30022',
        '30032',
        '30042',
        '30052',
        '30062',
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'PR-A-1': {
      stageId: 'pro_a_1',
      drops: [
        '3231',
        '3261'
      ]
    },
    'PR-A-2': {
      stageId: 'pro_a_2',
      drops: [
        '3232',
        '3262'
      ]
    },
    'PR-B-1': {
      stageId: 'pro_b_1',
      drops: [
        '3241',
        '3251'
      ]
    },
    'PR-B-2': {
      stageId: 'pro_b_2',
      drops: [
        '3242',
        '3252'
      ]
    },
    'PR-C-1': {
      stageId: 'pro_c_1',
      drops: [
        '3211',
        '3271'
      ]
    },
    'PR-C-2': {
      stageId: 'pro_c_2',
      drops: [
        '3212',
        '3272'
      ]
    },
    'PR-D-1': {
      stageId: 'pro_d_1',
      drops: [
        '3221',
        '3281'
      ]
    },
    'PR-D-2': {
      stageId: 'pro_d_2',
      drops: [
        '3222',
        '3282'
      ]
    },
    'LS-1': {
      stageId: 'wk_kc_1',
      drops: [
        '2002',
        '2001'
      ]
    },
    'LS-2': {
      stageId: 'wk_kc_2',
      drops: [
        '2002',
        '2001'
      ]
    },
    'LS-3': {
      stageId: 'wk_kc_3',
      drops: [
        '2003',
        '2002',
        '2001'
      ]
    },
    'LS-4': {
      stageId: 'wk_kc_4',
      drops: [
        '2004',
        '2003',
        '2002',
        '2001'
      ]
    },
    'LS-5': {
      stageId: 'wk_kc_5',
      drops: [
        '2004',
        '2003',
        '2002'
      ]
    },
    黄铁行动物资补给: {
      stageId: 'randomMaterialRune_1',
      drops: [
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'SV-1': {
      stageId: 'act10d5_01',
      drops: []
    },
    'SV-2': {
      stageId: 'act10d5_02',
      drops: []
    },
    'SV-3': {
      stageId: 'act10d5_03',
      drops: []
    },
    'SV-4': {
      stageId: 'act10d5_04',
      drops: []
    },
    'SV-5': {
      stageId: 'act10d5_05',
      drops: []
    },
    'SV-6': {
      stageId: 'act10d5_06',
      drops: []
    },
    'SV-7': {
      stageId: 'act10d5_07',
      drops: []
    },
    'TW-1': {
      stageId: 'act11d0_01',
      drops: []
    },
    'TW-2': {
      stageId: 'act11d0_02',
      drops: []
    },
    'TW-3': {
      stageId: 'act11d0_03',
      drops: []
    },
    'TW-4': {
      stageId: 'act11d0_04',
      drops: []
    },
    'TW-5': {
      stageId: 'act11d0_05',
      drops: []
    },
    'TW-6': {
      stageId: 'act11d0_06',
      drops: []
    },
    'TW-7': {
      stageId: 'act11d0_07',
      drops: []
    },
    'TW-8': {
      stageId: 'act11d0_08',
      drops: []
    },
    利刃行动物资补给: {
      stageId: 'randomMaterialRune_2',
      drops: [
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'RI-1': {
      stageId: 'act12d0_01',
      drops: []
    },
    'RI-2': {
      stageId: 'act12d0_02',
      drops: []
    },
    'RI-3': {
      stageId: 'act12d0_03',
      drops: []
    },
    'RI-4': {
      stageId: 'act12d0_04',
      drops: []
    },
    'RI-5': {
      stageId: 'act12d0_05',
      drops: []
    },
    'RI-6': {
      stageId: 'act12d0_06',
      drops: []
    },
    'RI-7': {
      stageId: 'act12d0_07',
      drops: []
    },
    'RI-8': {
      stageId: 'act12d0_08',
      drops: []
    },
    'FA-1': {
      stageId: 'act13d0_01',
      drops: []
    },
    'FA-2': {
      stageId: 'act13d0_02',
      drops: []
    },
    'FA-3': {
      stageId: 'act13d0_03',
      drops: []
    },
    'FA-4': {
      stageId: 'act13d0_04',
      drops: []
    },
    'FA-5': {
      stageId: 'act13d0_05',
      drops: []
    },
    'FA-6': {
      stageId: 'act13d0_06',
      drops: []
    },
    'FA-7': {
      stageId: 'act13d0_07',
      drops: []
    },
    'FA-8': {
      stageId: 'act13d0_08',
      drops: []
    },
    'MN-1': {
      stageId: 'act13d5_01',
      drops: []
    },
    'MN-2': {
      stageId: 'act13d5_02',
      drops: []
    },
    'MN-3': {
      stageId: 'act13d5_03',
      drops: []
    },
    'MN-4': {
      stageId: 'act13d5_04',
      drops: []
    },
    'MN-5': {
      stageId: 'act13d5_05',
      drops: []
    },
    'MN-6': {
      stageId: 'act13d5_06',
      drops: []
    },
    'MN-7': {
      stageId: 'act13d5_07',
      drops: []
    },
    'MN-8': {
      stageId: 'act13d5_08',
      drops: []
    },
    'S5-9': {
      stageId: 'sub_05-4-3',
      drops: [
        '31033',
        '31034',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'S3-7': {
      stageId: 'sub_03-3-2',
      drops: [
        '31033',
        '30012'
      ]
    },
    'R8-1': {
      stageId: 'main_08-01',
      drops: [
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    'R8-2': {
      stageId: 'main_08-02',
      drops: [
        '30073',
        '30074',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'R8-3': {
      stageId: 'main_08-03',
      drops: [
        '30013',
        '30014',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '31033',
        '30103'
      ]
    },
    'R8-4': {
      stageId: 'main_08-04',
      drops: [
        '30032'
      ]
    },
    'R8-5': {
      stageId: 'main_08-05',
      drops: [
        '30022',
        '2003'
      ]
    },
    'R8-6': {
      stageId: 'main_08-06',
      drops: [
        '2003',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    'R8-7': {
      stageId: 'main_08-07',
      drops: [
        '31023',
        '31024',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    'R8-8': {
      stageId: 'main_08-08',
      drops: [
        '31013',
        '30052'
      ]
    },
    'M8-6': {
      stageId: 'main_08-09',
      drops: [
        '30062',
        '2003'
      ]
    },
    'R8-9': {
      stageId: 'main_08-10',
      drops: [
        '30103',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '31033',
        '30103'
      ]
    },
    'R8-10': {
      stageId: 'main_08-11',
      drops: [
        '30083',
        '30084',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '31033',
        '30103'
      ]
    },
    'M8-7': {
      stageId: 'main_08-12',
      drops: [
        '30023',
        '30042'
      ]
    },
    'R8-11': {
      stageId: 'main_08-13',
      drops: [
        '31033',
        '31034',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    'M8-8': {
      stageId: 'main_08-14',
      drops: [
        '30063',
        '30011',
        '30061',
        '30012',
        '30062',
        '30013',
        '30063',
        '30073',
        '31013',
        '3003'
      ]
    },
    'JT8-1': {
      stageId: 'main_08-15',
      drops: []
    },
    'JT8-2': {
      stageId: 'main_08-16',
      drops: [
        '31013',
        '31014',
        '30031',
        '30051',
        '30032',
        '30052',
        '30033',
        '30053',
        '30093',
        '31033',
        '30103'
      ]
    },
    'JT8-3': {
      stageId: 'main_08-17',
      drops: [
        '30053',
        '30021',
        '30041',
        '2001',
        '30022',
        '30042',
        '2002',
        '30023',
        '30043',
        '30083',
        '31023',
        '2003'
      ]
    },
    感谢庆典物资补给: {
      stageId: 'randomMaterial_4',
      drops: [
        '30012',
        '30022',
        '30032',
        '30042',
        '30052',
        '30062',
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023',
        '31033'
      ]
    },
    燃灰行动物资补给: {
      stageId: 'randomMaterialRune_3',
      drops: [
        '30013',
        '30023',
        '30033',
        '30043',
        '30053',
        '30063',
        '30073',
        '30083',
        '30093',
        '30103',
        '31013',
        '31023'
      ]
    },
    'MB-1': {
      stageId: 'act15d0_01',
      drops: []
    },
    'MB-2': {
      stageId: 'act15d0_02',
      drops: []
    },
    'MB-3': {
      stageId: 'act15d0_03',
      drops: []
    },
    'MB-4': {
      stageId: 'act15d0_04',
      drops: []
    },
    'MB-5': {
      stageId: 'act15d0_05',
      drops: []
    },
    'MB-6': {
      stageId: 'act15d0_06',
      drops: []
    },
    'MB-7': {
      stageId: 'act15d0_07',
      drops: []
    },
    'MB-8': {
      stageId: 'act15d0_08',
      drops: []
    },
    'BH-1': {
      stageId: 'act15d5_01',
      drops: []
    },
    'BH-2': {
      stageId: 'act15d5_02',
      drops: []
    },
    'BH-3': {
      stageId: 'act15d5_03',
      drops: []
    },
    'BH-4': {
      stageId: 'act15d5_04',
      drops: []
    },
    'BH-5': {
      stageId: 'act15d5_05',
      drops: []
    },
    'BH-6': {
      stageId: 'act15d5_06',
      drops: []
    },
    'BH-7': {
      stageId: 'act15d5_07',
      drops: []
    },
    'BH-8': {
      stageId: 'act15d5_08',
      drops: []
    }
  }
}
